Revit 2027 API
PointCloudOverrides.Assign Method
 Assigns values of the source overrides to this object.
Namespace: Autodesk.Revit.DB.PointClouds
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Assign(
	PointCloudOverrides other
)
Public Sub Assign (
	other As PointCloudOverrides
)
public:
void Assign(
	PointCloudOverrides^ other
)
member Assign :
        other : PointCloudOverrides -> unit
Parameters
other PointCloudOverrides
 The source overrides.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
PointCloudOverrides Class
Autodesk.Revit.DB.PointClouds Namespace